In [4]:
import sqlite3
# connect to db
conn = sqlite3.connect('music2001376.sqlite')
print('Opened database successully')

def create_table():
  stmt= '''CREATE TABLE Tracks
        (title  TEXT  NOT NULL,
        plays  INT   NOT NULL);'''
  conn.execute(stmt)
  print('Table has been created successfully!')

create_table()

Opened database successully
Table has been created successfully!

In [5]:
conn.execute("INSERT INTO Tracks (title, plays) \
      VALUES ('Save Your Tears', 20)")
conn.execute("INSERT INTO Tracks (title, plays) \
      VALUES ('Leveitating', 15)")

In [17]:
# retrieve tuples from table with for loop
def iterative_select():
    cursor = conn.execute("SELECT title, plays from Tracks")
    for row in cursor:
      # print("Title = ", row[0])
      # print("Plays = ", row[1], end="\n")
      print(f"{row}")
    print("Operation done successfully")
iterative_select()

('Save Your Tears', 20)
('Leveitating', 15)
Operation done successfully

In [15]:
# retrieve using fetchone()
def fetch_one():
  cur = conn.cursor()
  cur.execute("SELECT title, plays from Tracks")
  data = cur.fetchone()
  print(f"Data = {data}", end="\n")
  print("Operation done successfully")
fetch_one()

Data = ('Save Your Tears', 20)
Operation done successfully

In [16]:
# retrieve using fetchall()
def fetch_all():
  cur = conn.cursor()
  cur.execute("SELECT title, plays from Tracks")
  data = cur.fetchall()
  print(f"Data = {data}", end="\n")
  print("Operation done successfully")
fetch_all()

Data = [('Save Your Tears', 20), ('Leveitating', 15)]
Operation done successfully

In [19]:
# update tuple
def update_tuple():
  stmt="UPDATE Tracks SET plays = 5 WHERE title = 'Save Your Tears'"
  conn.execute(stmt)
update_tuple()
iterative_select()

('Save Your Tears', 5)
('Leveitating', 15)
Operation done successfully

In [20]:
# delete tuple
def delete_tuple():
  stmt="DELETE FROM Tracks where plays = 5"
  conn.execute(stmt)
delete_tuple()
iterative_select()

('Leveitating', 15)
Operation done successfully

In [26]:
conn.close()
conn = sqlite3.connect("order.db")
stmt = '''CREATE TABLE customers
      (customer_id INT PRIMARY KEY  NOT NULL,
       customer_name          TEXT  NOT NULL);
       '''
conn.execute(stmt)
print("Table has been created successfully")
stmt = '''CREATE TABLE orders
      (order_id TEXT PRIMARY KEY  NOT NULL,
       customer_id          INT  NOT NULL,
       amount            DOUBLE  NOT NULL,
       FOREIGN KEY(customer_id) REFERENCES customers(customer_id));
       '''
conn.execute(stmt)
print("Table has been created successfully")

Table has been created successfully
Table has been created successfully

In [28]:
def customer_insert():
  conn.execute("INSERT INTO customers(customer_id, customer_name) \
        VALUES (1, 'Arya')")
  conn.execute("INSERT INTO customers(customer_id, customer_name) \
        VALUES (2, 'Jon')")
  conn.execute("INSERT INTO customers(customer_id, customer_name) \
        VALUES (3, 'Robb')")
  conn.execute("INSERT INTO customers(customer_id, customer_name) \
        VALUES (4, 'Huan Yin')")

# prints customer table 
def customer_table():
  cur = conn.execute("SELECT * FROM customers")
  for row in cur:
    print(f"{row}")
customer_insert()
customer_table()

(1, 'Arya')
(2, 'Jon')
(3, 'Robb')
(4, 'Huan Yin')

In [36]:
def orders_insert():
  conn.execute("INSERT INTO orders(order_id, customer_id, amount) \
        VALUES ('01', 1, 19.99)")
  conn.execute("INSERT INTO orders(order_id, customer_id, amount) \
        VALUES ('02', 2, 66.66)")
  conn.execute("INSERT INTO orders(order_id, customer_id, amount) \
        VALUES ('03', 3, 17.56)")
  conn.execute("INSERT INTO orders(order_id, customer_id, amount) \
        VALUES ('04', 4, 88.88)")

# prints orders table
def orders_table():
  cur = conn.execute("SELECT * FROM orders")
  for row in cur:
    print(f"{row}")

orders_insert()
orders_table()

('01', 1, 19.99)
('02', 2, 66.66)
('03', 3, 17.56)
('04', 4, 88.88)

In [40]:
# Inner join
def inner_join():
  stmt = '''SELECT *
        FROM customers a
        INNER JOIN orders b
        ON a.customer_id = b.customer_id
        '''
  cur = conn.execute(stmt)
  for row in cur:
    print(f"{row}")
inner_join()

(1, 'Arya', '01', 1, 19.99)
(2, 'Jon', '02', 2, 66.66)
(3, 'Robb', '03', 3, 17.56)
(4, 'Huan Yin', '04', 4, 88.88)

In [41]:
# Inner join with condition
def inner_join_where():
  stmt = '''SELECT a.customer_name, b.order_id
        FROM customers a
        INNER JOIN orders b
        ON a.customer_id = b.customer_id
        WHERE b.amount > 20
        '''
  cur = conn.execute(stmt)
  for row in cur:
    print(f"{row}")
inner_join_where()

('Jon', '02')
('Huan Yin', '04')